takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
/**@brief Function for handling the Health Thermometer Service events.
 *
 * @details This function will be called for all Health Thermometer Service events which are passed
 *          to the application.
 *
 * @param[in] p_hts  Health Thermometer Service structure.
 * @param[in] p_evt  Event received from the Health Thermometer Service.
 */
static void on_hts_evt(ble_hts_t * p_hts, ble_hts_evt_t * p_evt)
{
    temperature_measurement_send();
    /*
    switch (p_evt->evt_type)
    {
        case BLE_HTS_EVT_INDICATION_ENABLED:
            // Indication has been enabled, send a single temperature measurement
            temperature_measurement_send();
            break;

        case BLE_HTS_EVT_INDICATION_CONFIRMED:
            m_hts_meas_ind_conf_pending = false;
            break;

        default:
            // No implementation needed.
            break;
    }
    */
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

uint16_t Number_of_command = 4;
static const char * NusCommand[] = 
{
    "sta",    /* 0: start measurement command */
    "sto",    /* 1: stop measurement command  */
    "rqs",    /* 2: request series command    */
    "rqd",    /* 3: request data command      */
};

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        char com_buf[256] = {};
        uint16_t i;

        char restime[] =    "2018-12-25T12:20:15+9";
        char resdatanum[] = ",10";
        char respulse[] =   ",100,101,102,103,104,105,106,107,108,109";
        char restemp[] =    ",36.00,36.01,36.02,36.03,36.04,36.05,36.06,36.07,36.08,36.09";
        char resdata[256] = {};

        // NRF_LOG_INFO("nus_data_handler");

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        // NRF_LOG_INFO("p_evt->params.rx_data.p_data: %s", p_evt->params.rx_data.p_data);
        // for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        for (i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
                //NRF_LOG_INFO("string: %c", p_evt->params.rx_data.p_data[i]);
                com_buf[i] = p_evt->params.rx_data.p_data[i];
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
        com_buf[i] = '\0';
        NRF_LOG_INFO("command: %s", com_buf);
        /*
        err_code = ble_nus_data_send(&m_nus, com_buf, &i, m_conn_handle);
        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
        */
        uint16_t reslength;

        for (i = 0; i < Number_of_command; i++)
        {
          if((strcmp(com_buf, NusCommand[i])) == 0)
          {
              //NRF_LOG_INFO("ack");
              /*
              reslength = 3;
              err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
              if ((err_code != NRF_ERROR_INVALID_STATE) &&
                  (err_code != NRF_ERROR_RESOURCES) &&
                  (err_code != NRF_ERROR_NOT_FOUND))
              {
                  APP_ERROR_CHECK(err_code);
              }
              */
              switch (i)
              {
                  case 0:   // 0: sta
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                      break;
                  case 1:   // 1: sto
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                      break;
                  case 2:   // 2: rqs
                      reslength = 3;
                      err_code = ble_nus_data_send(&m_nus, "100", &reslength, m_conn_handle);
                      break;
                  case 3:   // 3: rqd
                      reslength = strlen(restime) + strlen(resdatanum) + strlen(respulse) + strlen(restemp);
                      //char resdata[reslength];
                      strcpy(resdata, restime);
                      //memcpy(resdata, restime, 0);
                      strcat(resdata, resdatanum);
                      strcat(resdata, respulse);
                      strcat(resdata, restemp);
                      NRF_LOG_INFO("res: %s", resdata);
                      err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                      break;
                  default:
                      break;
              }
              if ((err_code != NRF_ERROR_INVALID_STATE) &&
                  (err_code != NRF_ERROR_RESOURCES) &&
                  (err_code != NRF_ERROR_NOT_FOUND))
              {
                  APP_ERROR_CHECK(err_code);
              }
              break;
          }
        }
        if (i == Number_of_command)
        {
            //NRF_LOG_INFO("nak");
            reslength = 3;
            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
            if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND))
            {
                APP_ERROR_CHECK(err_code);
            }
        }
    }

